# Напишите программу для печати всех уникальных значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
# ---------------------------------------------------

lis = [{"V": "S001"},
       {"V": "S002"},
       {"VI": "S001"},
       {"VI": "S005"},
       {"VII": "S005"},
       {" V ": "S009"},
       {" VIII ": "S007"}]

s = set(val for dic in lis for val in dic.values())

# s = set()         # запись, аналогичная предыдущей
# for dic in lis:
#    for val in dic.values():
#       s.add(val)

for x in s:
    print({x})
print(f'Кол-во уникальных значений: {len(s)}')

# -----------------------------------------------
# Решение группы_1

a = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"},
     {"VII": "S005"}, {" V ": " S009 "}, {" VIII": " S007 "}]
s = set()
for i in a:
    s.add(*i.values())  # символ (*) раскрывает словарь (выбирает только значения, без ключей)
# print(i.values())
print(*s)
# ----------------------------------------------------
# Решение группы_2

data = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ": " S009 "},
        {" VIII ": " S007 "}]  # список
print(data)
result_set = set()
for elem in data:
    for value in elem.values():
    result_set.add(value.strip())
print(result_set)
